demo/app/controllers/acts_controller.rb

  def show
    @act = Act.find(params[:id])
---
SELECT * FROM "acts" WHERE ("acts"."id" = 1)

  def edit
    @act = Act.find(params[:id])
---
SELECT * FROM "acts" WHERE ("acts"."id" = 1)

  def create
    @act = Act.new(params[:act])

    respond_to do |format|
      if @act.save
---
INSERT INTO "acts" ("updated_at", "dcfcode", "itemcode", "plandate", "acttypecode", "visitdate", "drfcode", "created_at") VALUES('2010-05-01 08:05:04', '001', 'BUF', '2010-05-01', 'D', NULL, '101', '2010-05-01 08:05:04')

  def update
    @act = Act.find(params[:id])

    respond_to do |format|
      if @act.update_attributes(params[:act])
---
SELECT * FROM "acts" WHERE ("acts"."id" = 1)
UPDATE "acts" SET "visitdate" = '2010-05-01', "updated_at" = '2010-05-01 08:14:57' WHERE "id" = 1

  def destroy
    @act = Act.find(params[:id])
    @act.destroy
---
SELECT * FROM "acts" WHERE ("acts"."id" = 7)
DELETE FROM "acts" WHERE "id" = 7