demo/app/controllers/acttypes_controller.rb

SELECT * FROM "acttypes"
---
  def index
    @acttypes = Acttype.all

SELECT * FROM "acttypes" WHERE ("acttypes"."id" = 1)
---
  def show
    @acttype = Acttype.find(params[:id])

SELECT * FROM "acttypes" WHERE ("acttypes"."id" = 1)
---
  def edit
    @acttype = Acttype.find(params[:id])

INSERT INTO "acttypes" ("updated_at", "acttypename", "acttypecode", "created_at") VALUES('2010-05-01 07:56:26', 'ディテール', 'D', '2010-05-01 07:56:26')
---
  def create
    @acttype = Acttype.new(params[:acttype])

    respond_to do |format|
      if @acttype.save

SELECT * FROM "acttypes" WHERE ("acttypes"."id" = 1)
UPDATE "acttypes" SET "acttypename" = 'Detail', "updated_at" = '2010-05-01 08:03:08' WHERE "id" = 1
---
  def update
    @acttype = Acttype.find(params[:id])

    respond_to do |format|
      if @acttype.update_attributes(params[:acttype])