demo/app/controllers/dcfs_controller.rb

  def index
    @dcfs = Dcf.all
---
SELECT * FROM "dcfs"

  def show
    @dcf = Dcf.find(params[:id])
---
SELECT * FROM "dcfs" WHERE ("dcfs"."id" = 1)

  def edit
    @dcf = Dcf.find(params[:id])
---
SELECT * FROM "dcfs" WHERE ("dcfs"."id" = 1)

  def create
    @dcf = Dcf.new(params[:dcf])

    respond_to do |format|
      if @dcf.save
---
INSERT INTO "dcfs" ("updated_at", "dcfcode", "dcfname", "created_at") VALUES('2010-05-01 07:54:36', '001', '大阪大学病院', '2010-05-01 07:54:36')

  def update
    @dcf = Dcf.find(params[:id])

    respond_to do |format|
      if @dcf.update_attributes(params[:dcf])
---
SELECT * FROM "dcfs" WHERE ("dcfs"."id" = 1)
UPDATE "dcfs" SET "dcfname" = 'Osaka University Hospital', "updated_at" = '2010-05-01 07:58:02' WHERE "id" = 1