demo/app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM "items"

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("itemname", "updated_at", "itemcode", "created_at") VALUES('バファリン', '2010-05-01 07:55:56', 'BAF', '2010-05-01 07:55:56')

  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)
UPDATE "items" SET "itemcode" = 'BUF', "itemname" = 'Bufferin', "updated_at" = '2010-05-01 08:01:08' WHERE "id" = 1